//Homework #1 (11.05.2023)
// 1)Напишіть програму, яка перевіряє, чи є задане число парним, використовуючи тернарний оператор.

let num = 11;

num % 2 === 0 ? console.log(`Задане число ${num} - парне`) : console.log(`Задане число ${num} - не парне`);

/* 2)Напишіть програму, яка перевіряє, чи задане число є додатнім або від'ємним, 
використовуючи умову if-else. */

if (num === 0) {
  console.log("Задане число 0!");
} else if (num > 0) {
  console.log("Задане число додатнє!");
} else {
  console.log("Задане число від'ємне!");
}

/* 3)Напишіть програму, яка перевіряє, чи введене число належить до діапазону від 1 до 10,
 використовуючи оператор switch case. */

switch (num) {
  case 1:
  case 2:
  case 3:
  case 4:
  case 5:
  case 6:
  case 7:
  case 8:
  case 9:
  case 10:
    console.log("Число належить до діапазону від 1 до 10");
    break;
  default:
    console.log("Число не належить до діапазону від 1 до 10");
}

//4)Напишіть програму, яка визначає, чи є задана літера голосною чи приголосною, використовуючи оператор switch case.

let letter = "Є";

switch (letter.toLowerCase()) {
  case "а":
  case "е":
  case "є":
  case "и":
  case "і":
  case "ї":
  case "о":
  case "у":
  case "ю":
  case "я":
    console.log("Літера голосна!");
    break;
  default:
    console.log("Літера приголосна!");
}

// 5)Напишіть програму, яка виводить на екран всі числа від 1 до 20, використовуючи цикл for.

let res = " ";

for (let i = 1; i <= 20; i++) {
  res += `${i} `;
}

console.log(res);

// 6)Напишіть програму, яка виводить на екран суму всіх чисел від 1 до заданого числа, використовуючи цикл while.

let sum = 0;
let i = 1;

while (i <= num) {
  sum += i;
  i++;
}

console.log(sum);

// 7) Напишіть програму, яка виводить на екран таблицю множення для числа 5, використовуючи цикл for.

for (let i = 0; i <= 10; i++) {
  console.log(`9 x ${i} = ${9 * i}`);
}
