// ДЗ:
// 1)Напишіть програму, яка перевіряє, чи є задане число парним, використовуючи тернарний оператор.

// let number = +prompt('enter number?');
number % 2 == 0 ? console.log('even') : console.log('odd');


// 2)Напишіть програму, яка перевіряє, чи задане число є додатнім або від'ємним, використовуючи умову if-else.


// 3)Напишіть програму, яка перевіряє, чи введене число належить до діапазону від 1 до 10, використовуючи оператор switch case.
// 4)Напишіть програму, яка визначає, чи є задана літера голосною чи приголосною, використовуючи оператор switch case.
// 5)Напишіть програму, яка виводить на екран всі числа від 1 до 20, використовуючи цикл for.
// 6)Напишіть програму, яка виводить на екран суму всіх чисел від 1 до заданого числа, використовуючи цикл while.
// 7) Напишіть програму, яка виводить на екран таблицю множення для числа 5, використовуючи цикл for.
