// ДЗ:
// 1) задача про мудрого старого та шахи 
// 2) розрахувати і вивести за допомогою циклу 11-те число Фібоначчі, ряд починати з 0
// 3) відсортувати масив за допомогою бульбашкового способу [5,1,9,4,2,7,3,8,6]
// 4) Дано число n=1000. Діліть його на 2 стільки разів, поки результат ділення не стане менше 50. Яке число вийде? Порахуйте кількість ітерацій, необхідних для цього і запишіть їі в змінну num.
// 5) Якщо задано число n, вивести кількість парних чисел більше 0 та менше n
// 6) Компанія по транспортуванню меблів заносить будь-які меблі на 1-й поверх безкоштовно, з 2-го по 4-й включно - по 20грн., з 5-го по 7-й включно - по 30грн., а з 8-го и вище - по 40грн. Спитайте у користувача, на який поверх треба занести меблі, и розрахуйте вартість заносу.
// 7) за допомогою циклу розрахувати факторіал числа 5
// ****) зробити з зірочок ромб